Tekla Open API Reference for Tekla Structures 2025
Connection.GetPrimaryObject Method
 Returns the primary object of the connection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject GetPrimaryObject()
Public Function GetPrimaryObject As ModelObject
Return Value
Type: ModelObject
The primary object.
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace